---
kind: enumMember
id: F:Autodesk.Revit.UI.Selection.PickBoxStyle.Enclosing
enum: Autodesk.Revit.UI.Selection.PickBoxStyle
source: html/b66a5404-4dba-abc0-f16d-0477e5c8a974.htm
---
# Autodesk.Revit.UI.Selection.PickBoxStyle.Enclosing

Draws the box with the style that is used when selecting objects that are completely enclosed by the box.